# IFC_CreateObjGUID

## Description
Create a Tag record for the specified object if it doesn't have any IFC info.

```pascal
FUNCTION IFC_CreateObjGUID(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.IFC_CreateObjGUID(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2018
## Category
* IFC